# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'aws/tap'
# Here you'll find bottles of mas for macOS.
tap 'mas-cli/tap'

# Binaries & Libraries: brew install <package>
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
# brew 'ffmpeg'
# brew 'gh'
brew 'git'
brew 'git-flow'
# brew 'gnupg'
# brew 'grep'
# brew 'httpie'
# brew 'hub'
# brew 'java'
# brew 'mackup'
brew 'mas' # Mac App Store manager
# brew 'mas-cli/tap/mas' # Here you'll find bottles of mas for older versions of macOS. If you want to switch back to the core mas formula, you can remove mas-cli/tap/mas - brew untap mas-cli/tap
# brew 'pkg-config'
brew 'ruby'
# brew 'svn'
# brew 'zlib' # Needed for Memcached

# Development: brew install <package>
brew 'awscli'
brew 'aws-cdk'
brew 'aws-sam-cli'
brew 'cli53' # Amazon Route53 cli tool to export and manage zone records
brew 'composer'
# brew 'imagemagick'
# brew 'libmemcached'
brew 'http-server'
# brew 'meilisearch'
# brew 'memcached'
brew 'mysql'
# brew 'nginx'
brew 'node'
brew 'node@16'
brew 'php'
# brew 'php@7.4'  # disabled
# brew 'php@7.3' # deprecated
# brew 'redis'
brew 'yarn'

# Applications: brew install --cask <package>
# cask '1password'
# cask '1password-cli'
# cask 'aerial'
# cask 'alfred'
# cask 'amazon-chime'
cask 'amazon-workdocs-drive'
cask 'amazon-workspaces'
# cask 'anydesk'
# cask 'caffeine
# cask 'cleanmymac'
# cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'iterm2'
cask 'figma'
cask 'firefox-developer-edition'
cask 'github'
cask 'google-chrome'
# cask 'imageoptim'
# cask 'insomnia'
# cask 'microsoft-teams'
cask 'opera'
#cask 'phpmon'
cask 'rightfont'
# cask 'signal'
# cask 'sizzy'
cask 'slack'
cask 'sourcetree'
cask 'tableplus'
# cask 'telegram-desktop'
# cask 'the-unarchiver'
# cask 'tinkerwell'
# cask 'transmission'
# cask 'transmit'
# cask 'tuple'
# cask '--no-quarantine wine-stable' # https://github.com/Gcenx/macOS_Wine_builds (used for mikrotik winbox.exe)
cask 'visual-studio-code'
cask 'zoom'

# Fonts: brew install --cask <font>
cask font-jetbrains-mono
# cask 'font-fira-code'
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# App Store: mas install <id>
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694
mas 'Microsoft Remote Desktop' id: 1295203466
