# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'aws/tap'

# Binaries: brew install <package>
brew 'awscli'
brew 'aws-cdk'
brew 'aws-sam-cli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-flow'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'ruby'
brew 'svn'
brew 'iterm2'
brew 'zlib' # Needed for Memcached

# Development: brew install <package>
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'meilisearch'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Applications: brew install --cask <package>
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'amazon-chime'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'imageoptim'
brew 'java'
cask 'phpmon'
cask 'signal'
cask 'sizzy'
cask 'slack'
cask 'sourcetree'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmit'
cask 'tuple'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# App Store: mas install <id>
mas 'CleanMyMac X', id: 1339170533
mas 'Jira Cloud by Atlassian', id: 1475897096
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825